<?php

    namespace RaccoonSoftware\Slug;


    class Slug
    {
        public static function convert($title, $separator = '-') {
            $matrix = [
                'й' => 'i', 'ц' => 'c', 'у' => 'u', 'к' => 'k', 'е' => 'e',
                'н' => 'n', 'г' => 'g', 'ш' => 'sh', 'щ' => 'shch', 'з' => 'z',
                'х' => 'h', 'ъ' => '', 'ф' => 'f', 'ы' => 'y', 'в' => 'v',
                'а' => 'a', 'п' => 'p', 'р' => 'r', 'о' => 'o', 'л' => 'l',
                'д' => 'd', 'ж' => 'zh', 'э' => 'e', 'ё' => 'e', 'я' => 'ya',
                'ч' => 'ch', 'с' => 's', 'м' => 'm', 'и' => 'i', 'т' => 't',
                'ь' => '', 'б' => 'b', 'ю' => 'yu', 'ү' => 'u', 'қ' => 'k',
                'ғ' => 'g', 'ә' => 'e', 'ң' => 'n', 'ұ' => 'u', 'ө' => 'o',
                'Һ' => 'h', 'һ' => 'h', 'і' => 'i', 'ї' => 'ji', 'є' => 'je',
                'ґ' => 'g', 'Й' => 'I', 'Ц' => 'C', 'У' => 'U', 'Ұ' => 'U',
                'Ө' => 'O', 'К' => 'K', 'Е' => 'E', 'Н' => 'N', 'Г' => 'G',
                'Ш' => 'SH', 'Ә' => 'E', 'Ң ' => 'N', 'З' => 'Z', 'Х' => 'H',
                'Ъ' => '', 'Ф' => 'F', 'Ы' => 'Y', 'В' => 'V', 'А' => 'A',
                'П' => 'P', 'Р' => 'R', 'О' => 'O', 'Л' => 'L', 'Д' => 'D',
                'Ж' => 'ZH', 'Э' => 'E', 'Ё' => 'E', 'Я' => 'YA', 'Ч' => 'CH',
                'С' => 'S', 'М' => 'M', 'И' => 'I', 'Т' => 'T', 'Ь' => '',
                'Б' => 'B', 'Ю' => 'YU', 'Ү' => 'U', 'Қ' => 'K', 'Ғ' => 'G',
                'Щ' => 'SHCH', 'І' => 'I', 'Ї' => 'YI', 'Є' => 'YE', 'Ґ' => 'G',
                'a' => 'a', 'b' => 'b', 'c' => 'c', 'ç' => 'c', 'd' => 'd',
                'e' => 'e', 'f' => 'f', 'g' => 'g', 'ğ' => 'ğ', 'h' => 'h',
                'ı' => 'i', 'i' => 'i', 'j' => 'j', 'k' => 'k', 'l' => 'l',
                'm' => 'm', 'n' => 'n', 'o' => 'o', 'ö' => 'o', 'p' => 'p',
                'r' => 'r', 's' => 's', 'ş' => 's', 't' => 't', 'u' => 'u',
                'ü' => 'u', 'v' => 'v', 'y' => 'y', 'z' => 'z', 'x' => 'x',
                'w' => 'w',
                'A' => 'a', 'B' => 'b', 'C' => 'c', 'Ç' => 'C', 'D' => 'D',
                'E' => 'E', 'F' => 'F', 'G' => 'G', 'Ğ' => 'Ğ', 'H' => 'H',
                'I' => 'I', 'İ' => 'I', 'J' => 'J', 'K' => 'K', 'L' => 'L',
                'M' => 'M', 'N' => 'N', 'O' => 'O', 'Ö' => 'O', 'P' => 'P',
                'R' => 'R', 'S' => 'S', 'Ş' => 'S', 'T' => 'T', 'U' => 'U',
                'Ü' => 'U', 'V' => 'V', 'Y' => 'Y', 'Z' => 'Z', 'X' => 'X',
                'W' => 'W',

            ];

            foreach ($matrix as $from => $to) {
                $title = mb_eregi_replace($from, $to, $title);
            }

            $pattern = '![^' . preg_quote($separator) . '\pL\pN\s]+!u';
            $title = preg_replace($pattern, '', mb_strtolower($title));
            $flip = $separator == '-' ? '_' : '-';
            $title = preg_replace('![' . preg_quote($flip) . ']+!u', $separator, $title);
            $title = preg_replace('![' . preg_quote($separator) . '\s]+!u', $separator, $title);

            return trim($title, $separator);

        }
    }